print('Входные данные')
N = int(input())
print('2^N =', 2**N)
